In [1]:
# To use `Pandas`, you'll typically start with the following line of code.
import pandas as pd

## Creating Data
There are two core objects in pandas: the `DataFrame` and the `Series`

#### DataFrame
A **DataFrame is a table**.\
It contains an array of individual entries, each of which has a certain value.\
Each entry correspoinds to a row (or record) and a column.

In [2]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In [3]:
pd.DataFrame({'Apples': [30], 'Bananas': [21]})

   Apples  Bananas
0      30       21

In [4]:
pd.DataFrame({'Bob': ['I like it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})

             Bob           Sue
0     I like it.  Pretty good.
1  It was awful.        Bland.

We are using the `pd.DataFrame()` constructor to generate these DataFrame objects.\
The syntax for declaring a new one is a dictionary whose keys are the column names (`Bob` and `Sue` in this example), and\
whose values are a list of entries. This is the standard way of constructing a new DataFrame, and the one you\
are most likely to encounter.

### Row lables
The list of row labels used in a DataFrame is known as an `Index`.\
We can assign values to it by using an `index` parameter in our constructor:

In [5]:
pd.DataFrame({
    'Bob': ['I liked it.', 'It was awful.'],
    'Sue': ['Pretty good.', 'Bland.']},
    index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

In [6]:
fruit_sales = pd.DataFrame({
    'Apples': [35,41],
    'Bananas': [21,34]},
    index=['Sale 2019', 'Sale 2020'])

fruit_sales

           Apples  Bananas
Sale 2019      35       21
Sale 2020      41       34

In [10]:
data = pd.DataFrame({'Column': ['row_1', 'row_2'], 'Henessey': ['xo', None]}, index=['one', 'two'])
data

    Column Henessey
one  row_1       xo
two  row_2     None

## Selecting the prediction target
You can pull out a variable with `dot-notation`. This single column is stored in a `Series`, which is broadly like a\
DataFrame with only a single column of data.

**We'll use the dot natation to select the column we want to predict**, which is called the `prediction target`.\
By convention, the prediction target is called `y`.\

In [16]:
# Include DataFrame
melbourne_file_path = '../data/002/melb_data.csv'
melbourne_data = pd.read_csv(melbourne_file_path)

In [20]:
melbourne_data.head(1)

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0

In [26]:
y = melbourne_data.Price
y

0        1480000.0
1        1035000.0
2        1465000.0
3         850000.0
4        1600000.0
           ...
13575    1245000.0
13576    1031000.0
13577    1170000.0
13578    2500000.0
13579    1285000.0
Name: Price, Length: 13580, dtype: float64

### Choosing "Features"
The columns that are inputted into our model (and later used to make predictions) are called "`features`".\
In our case, those would be the columns used to determine the home price. Sometimes, you will use all columns\
except the target as features. Other times you'll be better off with fewer features.

We select multiple features by providing a list of column names inside brackets.\
`Each item in that list should be a string`(with quotes).\
By convention, this data is called `X`.

Example:
```Python
melbourne_features = ['Rooms', 'Bathroom', 'Landsize', 'Lattitude', 'Longititude']
```

In [41]:
melbourne_features = ['Rooms', 'Bathroom', 'Landsize', 'Lattitude', 'Longtitude']

X = melbourne_data[melbourne_features]
X
# head - Visually checking your data with these commands is an important part of a data scientists's job.

       Rooms  Bathroom  Landsize  Lattitude  Longtitude
0          2       1.0     202.0  -37.79960   144.99840
1          2       1.0     156.0  -37.80790   144.99340
2          3       2.0     134.0  -37.80930   144.99440
3          3       2.0      94.0  -37.79690   144.99690
4          4       1.0     120.0  -37.80720   144.99410
...      ...       ...       ...        ...         ...
13575      4       2.0     652.0  -37.90562   145.16761
13576      3       2.0     333.0  -37.85927   144.87904
13577      3       2.0     436.0  -37.85274   144.88738
13578      4       1.0     866.0  -37.85908   144.89299
13579      4       1.0     362.0  -37.81188   144.88449

[13580 rows x 5 columns]

In [42]:
X.describe()

              Rooms      Bathroom       Landsize     Lattitude    Longtitude
count  13580.000000  13580.000000   13580.000000  13580.000000  13580.000000
mean       2.937997      1.534242     558.416127    -37.809203    144.995216
std        0.955748      0.691712    3990.669241      0.079260      0.103916
min        1.000000      0.000000       0.000000    -38.182550    144.431810
25%        2.000000      1.000000     177.000000    -37.856822    144.929600
50%        3.000000      1.000000     440.000000    -37.802355    145.000100
75%        3.000000      2.000000     651.000000    -37.756400    145.058305
max       10.000000      8.000000  433014.000000    -37.408530    145.526350

### Building your model
You will use the `scikit-learn` library to create your models. When coding, this library is written as `sklearn`, as you\
will see in the sample code. `Scikit-learn` is easily the most popular library for modeling the types of data typically stored\
in DataFrames.

The steps to building and using a model are:
- **Define**: What type of model will it be? A decision it be? A decision tree? Some other type of model? Some other parameters of the model type are specified too.
- **Fit**: Capture patterns from provided data. This is the heart of modeling.
- **Predict**: Just what it sounds like.
- **Evaluate**: Determine how accurate the model's predictions are.

Here is an example of defining a decision tree model with `scikit-learn` and fitting it with the features and target variable.

In [43]:
from sklearn.tree import DecisionTreeRegressor

# Define model. Specify a number for random_state to ensure same results each run.
melbourne_model = DecisionTreeRegressor(random_state=1)

# Fit model
melbourne_model.fit(X, y)

DecisionTreeRegressor(ccp_alpha=0.0, criterion='mse', max_depth=None,
                      max_features=None, max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, presort='deprecated',
                      random_state=1, splitter='best')

In [1]:
Help

NameError: name 'Help' is not defined